def number_to_words(n):
    units = ["один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
    teens = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
             "семнадцать", "восемнадцать", "девятнадцать"]
    tens = [ "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]


    if 1 <= n <= 9:
        return units[n - 1]
    elif 10 <= n <= 19:
        return teens[n - 10]
    else:
        if n % 10 == 0:
            return tens[n // 10 - 2]
        else:
            return tens[n // 10 - 2] + " " + units[(n % 10) - 1]
